Sets ordinate dimension setting
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting ordinateDimSetting
)
  Visual Basic
Public Sub SetOrdinateDimensionSetting ( _
	ordinateDimSetting As OrdinateDimensionSetting _
)
  Visual C++
public:
void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting^ ordinateDimSetting
)
 Parameters
  ordinateDimSetting
 Type:  Autodesk.Revit.DB OrdinateDimensionSetting
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  DimensionType Class
  Autodesk.Revit.DB Namespace